In [1]:
import pandas as pd

## Different Ways of Creating Pandas DataFrame
#### for csv it's: pandas.read_csv('file_name') or pandas.read_csv('file_location/file_name')

In [2]:
df = pd.read_csv('sample_weather_data.csv') 
# just file name; if both 'working directory and file locations' are (at) same (place)

In [3]:
df

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

In [4]:
df1 = pd.read_csv('/home/vins/Workspace/Py/python/ds_ml/plot/linear_algebra/sample_weather_data.csv')
# complete file location with its name; if file location is at different place than 'working directory' 
df1

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow

In [5]:
df[0:1]

        day  temperature  windspeed event
0  01/01/17           32          6  Rain

In [6]:
df[:]

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

In [7]:
df[1:4]

        day  temperature  windspeed  event
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow

In [8]:
df[1:2]

        day  temperature  windspeed  event
1  01/02/17           35          7  Sunny

In [9]:
df[1:3]

        day  temperature  windspeed  event
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow

In [10]:
df[1:8]

        day  temperature  windspeed  event
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

In [11]:
df[1:]

        day  temperature  windspeed  event
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

#### for Excel file., it's: pandas.read_excel('file_name', engine = 'openpyxl') or pandas.read_excel('file_location/file_name', engine = 'openpyxl')

In [12]:
# df_exl = pd.read_excel("sample_weather_data.xlsx", engine = 'openpyxl',)
# df_exl
df = pd.read_excel("/home/vins/Workspace/Py/python/ds_ml/pandas/wa_weather_1944_till_2016.xlsx", engine ='openpyxl')
df

,Year,Month,Day,rainfall_mm,min_temp_C,max_temp_C,daily_avg,daily_range,uv_MJ_m*m
0,1944,5,1,0.0,NaN,NaN,0.00,0.0,NaN
1,1944,5,2,0.0,NaN,NaN,0.00,0.0,NaN
2,1944,5,3,0.0,NaN,NaN,0.00,0.0,NaN
3,1944,5,4,4.3,NaN,NaN,0.00,0.0,NaN
4,1944,5,5,0.0,NaN,NaN,0.00,0.0,NaN
...,...,...,...,...,...,...,...,...,...
26538,2016,12,27,0.4,16.3,23.2,19.75,6.9,26.8
26539,2016,12,28,0.6,8.9,23.5,16.20,14.6,30.3
26540,2016,12,29,0.0,9.5,24.8,17.15,15.3,31.6
26541,2016,12,30,0.0,10.6,24.2,17.40,13.6,30.6
26542,2016,12,31,0.0,12.1,28.9,20.50,16.8,31.5

In [13]:
df_exl = pd.read_excel("/home/vins/Workspace/Py/python/ds_ml/pandas/sample_weather_data.xlsx", engine ='openpyxl')
df_exl

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-02-01           35          7  Sunny
2 2017-03-01           28          2   Snow

In [14]:
df_exl['temperature'] # df_exl.temperature

0    32
1    35
2    28
Name: temperature, dtype: int64

In [15]:
# df_exl['temperature'] or 
df_exl.temperature # both give same result

0    32
1    35
2    28
Name: temperature, dtype: int64

In [16]:
df_exl.temperature.max() # df_exl['temperature'].max() #; again both same...

35

#### pd.DataFrame using dictionary::

In [17]:
df_dict = pd.DataFrame(
{
    'day': ['01/01/2017', '01/02/2017', '01/03/2017'],
    'temperature': [32, 35, 28],
    'windspeed': [6, 7, 4],
    'event': ['Rain', 'Sunny', 'Snow']
}
)

In [18]:
df_dict

          day  temperature  windspeed  event
0  01/01/2017           32          6   Rain
1  01/02/2017           35          7  Sunny
2  01/03/2017           28          4   Snow

In [19]:
df_dict.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

#### pd.DataFrame using tuple::

In [20]:
df_tuple = pd.DataFrame(
    [
    ('01/01/17',32,6,'Rain'),
    ('01/02/17',35,7,'Sunny'),
    ('01/03/17',28,2,'Snow'),
    ],
    columns = ["day","temperature","windspeed","event"]
)

In [21]:
df_tuple

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow

#### pd.DataFrame using list of dictionary::

In [22]:
weather_list_of_dict = [
    {'day': '1/1/2017', 'temperature': 36, 'windspeed': 8, 'event': 'sunny'},
    {'day': '2/1/2017', 'temperature': 32, 'windspeed': 10, 'event': 'cloudy'},
    {'day': '3/1/2017', 'temperature': 28, 'windspeed': 6, 'event': 'rain'},
    {'day': '4/1/2017', 'temperature': 26, 'windspeed': 2, 'event': 'snow'}
]

weather_list_of_dict

[{'day': '1/1/2017', 'temperature': 36, 'windspeed': 8, 'event': 'sunny'},
 {'day': '2/1/2017', 'temperature': 32, 'windspeed': 10, 'event': 'cloudy'},
 {'day': '3/1/2017', 'temperature': 28, 'windspeed': 6, 'event': 'rain'},
 {'day': '4/1/2017', 'temperature': 26, 'windspeed': 2, 'event': 'snow'}]

In [23]:
df_list_dict = pd.DataFrame(weather_list_of_dict)
df_list_dict

        day  temperature  windspeed   event
0  1/1/2017           36          8   sunny
1  2/1/2017           32         10  cloudy
2  3/1/2017           28          6    rain
3  4/1/2017           26          2    snow

#### Similarly there are several ways to create a DataFrame like json and other file formats....